<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>

<!-- Mirrored from www.cs.vsb.cz/jancar/TEORET-INF/ANIMACE/Sadil/html/pump_uvod.htm by HTTrack Website Copier/3.x [XR&CO'2005], Mon, 09 Jun 2008 13:07:43 GMT -->
<head>
<title>pump_uvod</title>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1250">
<style type="text/css">
<!--
body,td,th {
	font-family: Times New Roman, Times, serif;
	font-size: 18px;
	color: #000000;
}
body {
	background-color: #FFFF99;
	margin-left: 20px;
	margin-top: 20px;
	margin-right: 20px;
	margin-bottom: 20px;
}
a:link {
	color: #800040;
}
a:visited {
	color: #800040;
}
a:hover {
	color: #800040;
}
a:active {
	color: #800040;
}
.styl11 {font-size: 18px; font-family: "Times New Roman", Times, serif; color: #000000;}
.styl14 {color: #0000CC}
.styl15 {color: #000000}
.styl17 {font-size: 18px}
.styl18 {
	font-size: 24px;
	font-weight: bold;
	color: #FF0000;
}
.styl19 {	font-size: 18px;
	color: #000000;
}
.styl16 {font-size: 20px; color: #FF0000;}
-->
</style></head>

<body>
<p align="center" class="styl11 styl18">Pumping lemma - úvod </p>
<p align="justify" class="styl11">&nbsp;</p>
<p align="justify" class="styl11">Regul&aacute;rn&iacute; jazyky jsou jazyky, kter&eacute; mohou b&yacute;t rozpoznateln&eacute; po&#269;&iacute;ta&#269;em s omezenou (tj. pevnou) pam&#283;t&iacute;. Takov&yacute; po&#269;&iacute;ta&#269; odpov&iacute;d&aacute; deterministick&eacute;mu kone&#269;n&eacute;mu automatu (d&aacute;le jen DKA). Av&scaron;ak je zde mnoho jazyk&#367;, na kter&eacute; n&aacute;m k rozpozn&aacute;n&iacute; kone&#269;n&aacute; pam&#283;&#357; neposta&#269;&iacute;. </p>
<p align="justify"><span class="styl17">Proto se v t&eacute;to &#269;&aacute;sti budeme vìnovat metodì, kter&aacute; je založen&aacute; na jin&eacute;m principu pod&aacute;n&iacute; p&#345;esn&eacute;ho argumentu neregul&aacute;rnosti nìjak&eacute;ho jazyka. Nebudeme se zde již zabývat kongruencí, ale budeme aplikovat jednoduchý zpùsob pozorování. Tento zpùsob bude zalo&#382;en&yacute; na faktu, &#382;e p&#345;ij&iacute;mac&iacute; v&yacute;po&#269;et dostate&#269;nì dlouh&eacute;ho slova musí projít cyklem, tj. vrátit se do stavu, ve kterém již byl</span><span class="styl17">, p&#345;itom takov&yacute; cyklus pak m&#367;&#382;eme opakovat libovoln&#283;-kr&aacute;t.</span></p>
<p align="justify" class="styl11"><span class="styl14"><span class="styl15">Jednoduch&yacute;m p&#345;&iacute;kladem je jazyk</span> L = {a<sup>n</sup>b<sup>n</sup>; n &gt; 0} <br>
  </span>Slova za&#269;&iacute;nají &uacute;sekem znakù<em>&nbsp; a</em>&nbsp;, za n&iacute;m n&aacute;sleduje stejn&#283; dlouh&yacute; &uacute;sek znakù <em>&nbsp;b</em>.
</p>
<p align="justify" class="styl11">V&scaron;imn&#283;me si, &#382;e je tu rozd&iacute;l oproti <span class="styl14">M = {a*b*}</span>, kter&yacute; je jazyk slov ze sekvenc&iacute; znakù <em>&nbsp;a&nbsp; </em>n&aacute;sledovan&yacute; sekvenc&iacute; znakù <em>&nbsp;b</em>, ale posloupnosti znakù tu mohou být jak stejné, tak i  r&#367;zné (a o kter&eacute;m v&iacute;me, &#382;e je regul&aacute;rn&iacute;, proto&#382;e je d&aacute;n regul&aacute;rn&iacute;m v&yacute;razem).</p>
<p align="justify"><span class="styl11">Pro&#269; nem&#367;&#382;e b&yacute;t L rozpoznateln&yacute; po&#269;&iacute;ta&#269;em s pevnou pam&#283;t&iacute;? Je vid&#283;t, že nemùžeme prostì spoèítat poèet výskytù písmene</span><span class="styl11">&nbsp; <em>a &nbsp;</em>a potom jej porovnat s po&#269;tem písmen  <em>&nbsp;b</em>. P&#345;edpokl&aacute;dejme, &#382;e m&aacute;me 32MB pam&#283;&#357;, to m&aacute;me 32*1024*1024*8 = 268435456 bit&#367;. Takov&yacute; po&#269;&iacute;ta&#269; odpov&iacute;d&aacute; obrovsk&eacute;mu DKA s 2<sup>268435456</sup> stavy. Nicm&eacute;n&#283;, po&#269;&iacute;ta&#269; m&#367;&#382;e po&#269;&iacute;tat pouze do 2<sup>268435456</sup>. K tomu n&aacute;m ov&scaron;em p&#345;edem omezen&aacute; pam&#283;&#357; nemus&iacute; sta&#269;it, proto&#382;e &uacute;sek&nbsp; <em>a&nbsp;</em>&nbsp;m&#367;&#382;e b&yacute;t libovoln&#283; dlouh&yacute;. Z toho d&#367;vodu bychom potøebovali nekoneèn&eacute; množstv&iacute; pamìti k rozpozn&aacute;n&iacute;&nbsp; <em>n</em>.</span></p>
<p align="justify">&nbsp;</p>
<p align="justify"><span class="styl17">Pokud je jazyk regul&aacute;rn&iacute;, pak zde existuje automat, kter&yacute; pøij&iacute;m&aacute; slova tohoto jazyka a poèet jeho stavù je roven &nbsp;<em>n</em>. Jestliže slovo v jazyce je delš&iacute; než&nbsp; <em>n,</em> pak mus&iacute; nutnì navšt&iacute;vit nìjak&yacute; stav nejm&eacute;nì dvakr&aacute;t. È&aacute;st slova, kter&aacute; zaè&iacute;n&aacute; a konè&iacute; v tom sam&eacute;m stavu se naz&yacute;v&aacute; podøetìzec a tvoø&iacute; cyklus. </span><span class="styl17">Tento podøetìzec budeme oznaèovat &nbsp;<em>v&nbsp; </em>a lze jej po jakkoli dlouhou dobu opakovat (&quot;pumpovat&quot;). Proto se tomu ø&iacute;k&aacute; <span class="styl14">pumping lemma</span>. </span></p>
<p align="justify">Vystupuje jako nástroj pro ukázání, že nìjaký jazyk není regulární.</p>
</body>

<!-- Mirrored from www.cs.vsb.cz/jancar/TEORET-INF/ANIMACE/Sadil/html/pump_uvod.htm by HTTrack Website Copier/3.x [XR&CO'2005], Mon, 09 Jun 2008 13:07:43 GMT -->
</html>
